Revit 2027 API
AlignmentStationLabelOptions.TypeId Property
 Specifies the ElementId of the label type. The default value is InvalidElementId. In this case, the default type id for alignment station labels in the document is used.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TypeId { get; set; }
Public Property TypeId As ElementId
	Get
	Set
public:
property ElementId^ TypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member TypeId : ElementId with get, set
Property Value
ElementId
Remarks
 Valid types can be found using IsValidType(Element).
See Also
Reference
AlignmentStationLabelOptions Class
Autodesk.Revit.DB.Infrastructure Namespace